{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_constraint": null, "batch_input_shape": [null, 1, 100, 100], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "same", "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "filters": 32, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "filters": 64, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3"}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "same", "activation": "relu", "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "filters": 64, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 256, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "units": 26, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "name": "dense_2"}}], "keras_version": "2.1.3"}